def split_by_fixed_char_count(text, count):
  return [text[i:i+count] for i in range(0, len(text), count)]


text = """
　　当袋底洞的比尔博?巴金斯先生宣布不久后会为自己一百一十一岁大寿举行盛大宴会时，哈比屯的居民都兴奋的议论纷纷。
　　比尔博不但非常富有，更是个特立独行的奇人。自从他神秘的失踪和奇迹似的归来之后，六十年以来，他在夏尔这一带一直是人们街头巷尾的议论话题。他从冒险途中所带回的庞大财富已经成了当地的传奇，不管这老家伙怎么说，一般人都相信袋底洞内的隧道装满各种各样的金银珠宝。即使这样的传奇不够让他出名，他老当益壮的外表也足以让人啧啧称奇。时间的流逝似乎在比尔博身上没有留下多少痕迹。他九十岁的时候与五十岁时并无二致。当他九十九岁时，附近的人开始称他"养生有术"，但恐怕"长生不老"是比较精确的说法。有许多人一想到这件事情就觉得老天未免太不公平了，怎么能够让人坐拥（传说中的）金山又同时拥有长生不老的能力呢。 
　　"这一定是有代价的，"他们说。"这是违逆天理的，一定会惹麻烦的！"
　　不过，到目前为止也没有什么麻烦；由于巴金斯先生十分慷慨，人们也就愿意原谅他的特立独行和得天独厚的好运。他依旧时常拜访亲戚（当然，素来不合的塞克维尔巴金斯一家是个例外），在地位较低和贫穷的家族中，他也拥有许多的崇拜者。不过，他一直没有什么亲近的朋友，直到他的年轻表亲年纪稍长之后才有了转变。 
　　这些表亲之中最年长的是佛罗多?巴金斯，同时也是比尔博最宠爱的对象。当比尔博九十九岁的时候，他将佛罗多收为养子，接他到袋底洞来住。这终于打破了塞克维尔一家人一直觊觎继承袋底洞的希望。比尔博和佛罗多刚好都是同一天生的，九月二十二日。"佛罗多啊，我说你最好过来跟我一起住吧，"比尔博有天这么说；"这样我们就可以一起舒舒服服的过生日了。"当时佛罗多还只是个少年。哈比人一向把成年的三十三岁和童年之间的二十多年间称做少年时期。
　　又过了十二年。每年这家人都会联合举办盛大的生日宴会，不过，现在大家都知道今年秋天的计画是非比寻常的。比尔博今年将满一百一十一岁，数字本身就相当特殊；即使对哈比人来说，这也已经是十分长寿的年纪了。（老图克大人也不过只活了一百三十岁）。而佛罗多今年则是满三十三岁，这是很重要的一个数字，因为今年他即将成年。
　　哈比屯和临水区一带的居民早就开始议论纷纷，有关这即将来临的大活动也传遍了整个夏尔。比尔博?巴金斯先生的冒险经历和独特的行事作风又再度成为街头巷尾的话题，老一辈的人突然间发现自己在这股怀旧风潮的推波助澜下，成了十分受欢迎的人物。
　　被称作"老家伙"的哈姆?詹吉可说是个中的翘楚。他经常在临水路旁的"常春树丛"小旅店高谈阔论。他可不是毫无依据的吹牛，老家伙已经照顾袋底洞的花园有四十年之久。由于他年事已高，动作有些迟缓了，因此大多数的工作都是由他最小的儿子山姆?詹吉来接手。父子两人都与比尔博和佛罗多十分友好。他们就居住在袋底洞的山下小丘上，地址是袋边路三号。
　　"我老早就说，比尔博先生是个相当好的哈比人，"老家伙宣称。这是千真万确的，因为比尔博对他非常有礼貌，平常都称呼他为哈姆法斯特先生，并且经常的在蔬菜种植的问题上请教他，特别是在根茎类植物的种植上更是执礼甚恭。老家伙在马铃薯这类植物方面可是第一把交椅。（连他自己也不吝承认） 
　　"但和他住在一起的佛罗多又怎么样？"临水区的老诺克问道。"他也叫作巴金斯，但他也有一半烈酒鹿家的血统。我也搞不清楚为什么会有哈比屯的巴金斯家人想要去找雄鹿地的怪家伙结婚。"
　　"也不能怪他们不合常理，"老家伙的隔壁邻居图伏特老爹说，"他们住在烈酒河的另一边，又靠近老林那边。那里可是个受诅咒的不祥之地。"
　　"你说的对，老爹！"老家伙说。"虽然雄鹿地的烈酒鹿那家子人不是住在老林里面，但他们的行事作风真的很奇怪。他们会在那条大河上搞艘船跑来跑去，这可不是正当人家会做的事情。难怪那里老是会有麻烦事。不管怎么样，佛罗多先生都是个好青年。他和比尔博先生很像，连想法都差不了多少。毕竟他父亲那边还是有巴金斯家的血统。德罗哥?巴金斯可是个好人，在他淹死之前可是个洁身自爱的家伙哪！"
　　"淹死？"听众中有人反问。他们当然听过这类恐怖的谣言，不过哈比人就是喜欢这种家族历史的故事；他们这次又想再听一次。
　　"嗯，他们是这样说的，"老家伙道。"我想一下喔，德罗哥先生娶了可怜的普丽谬拉?烈酒鹿小姐。她是比尔博先生母系的表妹（她妈妈是老图克最小的女儿）；德罗哥则是他的旁系亲戚。所以，佛罗多就是比尔博的表妹的儿子，这关系可深远著哪！德罗哥先生结婚之后就经常和去烈酒厅的岳父家斯混。（这家伙嘴可馋著呢，他岳父葛巴达克又爱吃好菜，两人就这么一拍即合）当时他去烈酒河上泛舟，他和他的妻子就这么翻船淹死了。可怜的佛罗多那时还只是个小孩啊！" 
　　"我听说他们是吃完饭之后准备在月光下泛舟，"老诺克说，"德罗哥吃得太多，把船给压沈了。"
　　"我听说是她把他推下去，而德罗哥又把老婆给拉下去，"哈比屯的磨坊主人山迪曼接口道。
"""
chunks = split_by_fixed_char_count(text, 100)

# for chunk in chunks:
#   print(chunk)



array = [i for i in range(0, 100, 10)]
print(array)